In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [1]:
l=[4,8,15,16,23,42]

In [3]:
series=pd.Series(l)

In [4]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [5]:
var=[123,45.32,'krishna',3+5j,[1234],{'sudh'},(555),{99:'topper'},345,1000]

In [6]:
series2=pd.Series(var)

In [7]:
print(series2)

0               123
1             45.32
2           krishna
3            (3+5j)
4            [1234]
5            {sudh}
6               555
7    {99: 'topper'}
8               345
9              1000
dtype: object

In [8]:
#Q3. Create a Pandas DataFrame that contains the following data:
data={'Name':['Alice','Bob','Claire'],
      'Age':[25,30,27],
      'Gender':['Female','Male','Female']}

In [9]:
df=pd.DataFrame(data)

In [10]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
data2=[['Alice',25,'Female'],
       ['Bob',30,'Male'],
       ['Claire',27,'Female']]

In [14]:
df2=pd.DataFrame(data2,columns=['Name','Age','City'])

In [15]:
print(df2)

     Name  Age    City
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
A4. DataFrame is a 2d data structure which consists of rows and columns used for data storage and manipulation.
    A series is a linear structure or array while dataframe is a 2d structure.
    Ex: A series is like a linear array or a train which consists of passengers only in one row while 
        data frame is like a sleeper class train where there are 3 rows and many columns.

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an 
    example of when you might use one of these functions?
A5. head(): Returns the first 5 rows of the DataFrame.
    tail(): Returns the last 5 rows of the DataFrame.
    sort_values(): Sorts the DataFrame by one or more columns.
    sum(): Computes the sum of values in each column or row.
    mean(): Calculates the mean of values in each column or row.
    Ex: If a column 9 in dataframe_studentmarks stores the marks of each individual student of class 9 and
        we need to find the average marks of class 9 students then we can use mean() function to directly get
        the average.

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
A6. All three are mutable data structures but series and dataframes are widely used these days.

In [16]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
sr1=pd.Series([1,2,3,4,5])
sr2=pd.Series(['one','two','three','four','five'])
frame=pd.DataFrame({'numerals':sr1,'words':sr2})

In [17]:
frame

   numerals  words
0         1    one
1         2    two
2         3  three
3         4   four
4         5   five